{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer": {"name": "input_layer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "180"}, {"size": "6"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "17"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "17"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "17"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "180"}, {"size": "6"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Shape", "op": "Shape", "input": ["input_layer"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/transpose", "op": "Transpose", "input": ["input_layer", "StatefulPartitionedCall/sequential_1/lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Shape", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/transpose", "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed", "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/loop_counter", "StatefulPartitionedCall/sequential_1/lstm_1/Max", "StatefulPartitionedCall/sequential_1/lstm_1/time", "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1", "StatefulPartitionedCall/sequential_1/lstm_1/zeros", "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1", "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor", "unknown", "unknown_0", "unknown_1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "_lower_using_switch_merge": {"b": false}, "cond": {"func": {"name": "__inference_sequential_1_lstm_1_while_cond_387_frozen_486"}}, "_num_original_outputs": {"i": "10"}, "parallel_iterations": {"i": "32"}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "64"}]}, {"dim": [{"size": "-1"}, {"size": "64"}]}, {}, {"dim": [{"size": "6"}, {"size": "256"}]}, {"dim": [{"size": "64"}, {"size": "256"}]}, {"dim": [{"size": "256"}]}]}}, "_read_only_resource_inputs": {"list": {"i": ["7", "8", "9"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while:3", "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3", "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu", "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/Relu", "StatefulPartitionedCall/sequential_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_2_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_2_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_2_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487", "inputArg": [{"name": "sequential_1_lstm_1_while_sequential_1_lstm_1_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_1_lstm_1_while_sequential_1_lstm_1_max", "type": "DT_INT32"}, {"name": "sequential_1_lstm_1_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_1_lstm_1_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_1_lstm_1_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_1_lstm_1_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "sequential_1_lstm_1_while_lstm_cell_1_cast_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_1_lstm_1_while_identity", "type": "DT_INT32"}, {"name": "sequential_1_lstm_1_while_identity_1", "type": "DT_INT32"}, {"name": "sequential_1_lstm_1_while_identity_2", "type": "DT_INT32"}, {"name": "sequential_1_lstm_1_while_identity_3", "type": "DT_VARIANT"}, {"name": "sequential_1_lstm_1_while_identity_4", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_identity_5", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_1_lstm_1_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "sequential_1_lstm_1_while_lstm_cell_1_cast_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["sequential_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "sequential_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "sequential_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/TensorArrayV2Write/TensorListSetItem/index", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/lstm_cell_1/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "op": "Identity", "input": ["sequential_1_lstm_1_while_lstm_cell_1_cast_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Identity", "input": ["sequential_1_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp", "op": "Identity", "input": ["sequential_1_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/add", "op": "AddV2", "input": ["sequential_1_lstm_1_while_placeholder", "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/add/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["sequential_1_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_1_lstm_1_tensorarrayunstack_tensorlistfromtensor_0", "sequential_1_lstm_1_while_placeholder", "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/add_1", "op": "AddV2", "input": ["sequential_1_lstm_1_while_sequential_1_lstm_1_while_loop_counter", "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/add_1/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["sequential_1_lstm_1_while_placeholder_2", "sequential_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp:output:0"], "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "sequential_1/lstm_1/while/NoOp", "op": "NoOp", "input": ["^sequential_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp", "^sequential_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^sequential_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp"]}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/MatMul", "op": "MatMul", "input": ["sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem:item:0", "sequential_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp:output:0"], "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "sequential_1/lstm_1/while/Identity_1", "op": "Identity", "input": ["sequential_1_lstm_1_while_sequential_1_lstm_1_max", "^sequential_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_1/lstm_1/while/Identity_2", "op": "Identity", "input": ["sequential_1/lstm_1/while/add:z:0", "^sequential_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_1/lstm_1/while/Identity", "op": "Identity", "input": ["sequential_1/lstm_1/while/add_1:z:0", "^sequential_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["sequential_1/lstm_1/while/lstm_cell_1/MatMul:product:0", "sequential_1/lstm_1/while/lstm_cell_1/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/add_1", "op": "AddV2", "input": ["sequential_1/lstm_1/while/lstm_cell_1/add:z:0", "sequential_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/split", "op": "Split", "input": ["__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/lstm_cell_1/split/split_dim:output:0", "sequential_1/lstm_1/while/lstm_cell_1/add_1:z:0"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["sequential_1/lstm_1/while/lstm_cell_1/split:output:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["sequential_1/lstm_1/while/lstm_cell_1/split:output:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/Tanh", "op": "Tanh", "input": ["sequential_1/lstm_1/while/lstm_cell_1/split:output:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["sequential_1/lstm_1/while/lstm_cell_1/split:output:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/mul", "op": "Mul", "input": ["sequential_1/lstm_1/while/lstm_cell_1/Sigmoid_1:y:0", "sequential_1_lstm_1_while_placeholder_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/mul_1", "op": "Mul", "input": ["sequential_1/lstm_1/while/lstm_cell_1/Sigmoid:y:0", "sequential_1/lstm_1/while/lstm_cell_1/Tanh:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/add_2", "op": "AddV2", "input": ["sequential_1/lstm_1/while/lstm_cell_1/mul:z:0", "sequential_1/lstm_1/while/lstm_cell_1/mul_1:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/Tanh_1", "op": "Tanh", "input": ["sequential_1/lstm_1/while/lstm_cell_1/add_2:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/Identity_5", "op": "Identity", "input": ["sequential_1/lstm_1/while/lstm_cell_1/add_2:z:0", "^sequential_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/lstm_cell_1/mul_2", "op": "Mul", "input": ["sequential_1/lstm_1/while/lstm_cell_1/Sigmoid_2:y:0", "sequential_1/lstm_1/while/lstm_cell_1/Tanh_1:y:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["sequential_1_lstm_1_while_placeholder_1", "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/TensorArrayV2Write/TensorListSetItem/index:output:0", "sequential_1/lstm_1/while/lstm_cell_1/mul_2:z:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "sequential_1/lstm_1/while/Identity_4", "op": "Identity", "input": ["sequential_1/lstm_1/while/lstm_cell_1/mul_2:z:0", "^sequential_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/lstm_1/while/Identity_3", "op": "Identity", "input": ["sequential_1/lstm_1/while/TensorArrayV2Write/TensorListSetItem:output_handle:0", "^sequential_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "ret": {"sequential_1_lstm_1_while_identity_5": "sequential_1/lstm_1/while/Identity_5:output:0", "sequential_1_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource": "sequential_1_lstm_1_while_lstm_cell_1_cast_1_readvariableop_resource_0", "sequential_1_lstm_1_while_identity_3": "sequential_1/lstm_1/while/Identity_3:output:0", "sequential_1_lstm_1_while_identity_1": "sequential_1/lstm_1/while/Identity_1:output:0", "sequential_1_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource": "sequential_1_lstm_1_while_lstm_cell_1_add_1_readvariableop_resource_0", "sequential_1_lstm_1_while_lstm_cell_1_cast_readvariableop_resource": "sequential_1_lstm_1_while_lstm_cell_1_cast_readvariableop_resource_0", "sequential_1_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_1_lstm_1_tensorarrayunstack_tensorlistfromtensor": "sequential_1_lstm_1_while_tensorarrayv2read_tensorlistgetitem_sequential_1_lstm_1_tensorarrayunstack_tensorlistfromtensor_0", "sequential_1_lstm_1_while_identity": "sequential_1/lstm_1/while/Identity:output:0", "sequential_1_lstm_1_while_identity_2": "sequential_1/lstm_1/while/Identity_2:output:0", "sequential_1_lstm_1_while_identity_4": "sequential_1/lstm_1/while/Identity_4:output:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "controlRet": {"sequential_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp": "sequential_1/lstm_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "sequential_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp": "sequential_1/lstm_1/while/lstm_cell_1/add_1/ReadVariableOp", "sequential_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp": "sequential_1/lstm_1/while/lstm_cell_1/Cast/ReadVariableOp"}, "argAttr": {"9": {"attr": {"_user_specified_name": {"s": "cmVzb3VyY2U="}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "c2VxdWVudGlhbF8xL2xzdG1fMS9UZW5zb3JBcnJheVVuc3RhY2svVGVuc29yTGlzdEZyb21UZW5zb3I="}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "c2VxdWVudGlhbF8xL2xzdG1fMS9NYXg="}}}, "7": {"attr": {"_user_specified_name": {"s": "cmVzb3VyY2U="}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "64"}]}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "c2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZS9sb29wX2NvdW50ZXI="}}}, "8": {"attr": {"_user_specified_name": {"s": "cmVzb3VyY2U="}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "64"}]}]}}}}}}, {"signature": {"name": "__inference_sequential_1_lstm_1_while_cond_387_frozen_486", "inputArg": [{"name": "sequential_1_lstm_1_while_sequential_1_lstm_1_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_1_lstm_1_while_sequential_1_lstm_1_max", "type": "DT_INT32"}, {"name": "sequential_1_lstm_1_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_1_lstm_1_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_1_lstm_1_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_sequential_1_lstm_1_while_cond_387___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "sequential_1_lstm_1_while_sequential_1_lstm_1_while_cond_387___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_sequential_1_lstm_1_while_cond_387___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "sequential_1_lstm_1_while_sequential_1_lstm_1_while_cond_387___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_1_lstm_1_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "__inference_sequential_1_lstm_1_while_cond_387_frozen_486/sequential_1/lstm_1/while/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "sequential_1/lstm_1/while/Less_1", "op": "Less", "input": ["sequential_1_lstm_1_while_sequential_1_lstm_1_while_loop_counter", "sequential_1_lstm_1_while_sequential_1_lstm_1_max"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_1/lstm_1/while/Less", "op": "Less", "input": ["sequential_1_lstm_1_while_placeholder", "__inference_sequential_1_lstm_1_while_cond_387_frozen_486/sequential_1/lstm_1/while/Less/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_1/lstm_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["sequential_1/lstm_1/while/Less_1:z:0", "sequential_1/lstm_1/while/Less:z:0"]}], "ret": {"sequential_1_lstm_1_while_identity": "sequential_1/lstm_1/while/LogicalAnd:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "c2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZS9sb29wX2NvdW50ZXI="}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}, "_user_specified_name": {"s": "c2VxdWVudGlhbF8xL2xzdG1fMS9NYXg="}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "64"}]}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "64"}]}]}}}}}}]}, "versions": {"producer": 1994, "minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Max", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1/num_elements", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [6, 256], "dtype": "float32"}, {"name": "unknown_0", "shape": [64, 256], "dtype": "float32"}, {"name": "unknown_1", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "shape": [64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Cast/ReadVariableOp", "shape": [64, 17], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_2_1/Add/ReadVariableOp", "shape": [17], "dtype": "float32"}, {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/add/y", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/TensorArrayV2Write/TensorListSetItem/index", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/lstm_cell_1/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "__inference_sequential_1_lstm_1_while_body_388_frozen_487/sequential_1/lstm_1/while/add_1/y", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_1_lstm_1_while_cond_387_frozen_486/sequential_1/lstm_1/while/Less/y", "shape": [], "dtype": "int32"}]}]}